[
    {
        "id": 1,
        "title": "Recipe Book",
        "details": "Goodie Foodie is a vibrant recipe-sharing platform where users from around the world can showcase their culinary creations. It serves as a global community for chefs—both professional and home cooks—to connect and inspire each other. Users can easily upload their own recipes, complete with ingredients and cooking steps, and receive feedback from the community. The platform also features a rating system so users can see how delicious and popular their recipes are among others.",
        "tec_used": [
            "React",
            "Tailwind",
            "css",
            "MongoDB",
            "Express",
            "Firebase"
        ],
        "live_link": "https://recipe-book-ddad9.web.app/",
        "frontend_repo": "https://github.com/dip00-bb/goodie-foodie",
        "backend_repo": "https://github.com/dip00-bb/goodie-foodie-server",
        "features": [
            "👨‍🍳 Users can add their own recipes",
            "✏️ Users can update their recipes",
            "🗑️ Users can delete their recipes",
            "🔐 Firebase Authentication for user login/signup",
            "🛡️ JWT Authorization to protect private routes"
        ],
        "images": [
            "https://i.ibb.co/270Vp7Xm/food1.png",
            "https://i.ibb.co/5XL7CsXz/food2.png",
            "https://i.ibb.co/DDxzDRzz/food3.png"
        ],
        "challenges": "I faced difficulties when trying to display all the recipes in a table. I attempted to build a custom table with pagination and sorting features, but it turned out to be very time-consuming. Later, I heard about React Table, which provides all the built-in features I needed, such as pagination and sorting",

        "improvement":"Future improvements for Recipe Book include implementing advanced search and filtering options so users can quickly find recipes based on ingredients, cuisine, or difficulty level. Adding AI-powered recipe suggestions and meal-planning tools could make the platform more engaging. Social sharing integrations would allow users to showcase their dishes on platforms like Facebook or Instagram. Additionally, optimizing image uploads with compression and enabling real-time collaboration features for group cooking projects could further enhance the user experience."

    },
    {
        "id": 2,
        "title": "Dev Blogs",
        "details": "Dev Blog is a global platform where developers from around the world share their knowledge and experiences through blogs. It fosters a supportive tech community by allowing readers to comment and engage with writers, providing motivation and valuable feedback. Our platform is dedicated to delivering the latest technology blogs faster than any other, keeping developers up-to-date with current trends. Whether you're a beginner or an expert, Dev Blog is your go-to source for learning and sharing in the tech world.",
        "tec_used": [
            "React",
            "Tailwind",
            "css",
            "MongoDB",
            "Express",
            "Firebase",
            "JWT"
        ],
        "live_link": "https://blog-website-724fe.web.app/",
        "frontend_repo": "https://github.com/dip00-bb/Dev-Blog",
        "backend_repo": "https://github.com/dip00-bb/dev-blog-server",
        "features": [
            "✍️ Users can add their own blogs",
            "✏️ Users can update their blogs",
            "🗑️ Users can delete their blogs",
            "💬 Users can comment on blogs",
            "🔐 Firebase Authentication for user login/signup",
            "🛡️ JWT Authorization to protect private routes"
        ],
        "images": [
            "https://i.ibb.co/rGmYCD1M/devblog1.png",
            "https://i.ibb.co/Gv8gCzRT/devblog2.png",
            "https://i.ibb.co/Kxz1JJfL/devblog3.png"
        ],
        "challenges": "In this blog, I implemented JWT authorization. Initially, it didn’t work properly because I hadn’t used the Firebase secret key to verify the token. After adding the key for verification, everything started working correctly.",
        "improvement":"Planned enhancements for Dev Blogs include integrating a rich text editor with markdown support for a better writing experience and adding an advanced search system with filters for tags, authors, or categories. Real-time notifications for comments, likes, or replies will boost engagement between writers and readers. Incorporating analytics dashboards will help authors track blog reach and popularity. Future updates may also include AI-assisted blog topic recommendations and multi-language support to make the platform more accessible to a global audience."
    },
    {
        "id": 3,
        "title": "Sub Box",
        "details": "LavaRox is an OTT subscription platform that lets users conveniently purchase subscriptions to popular streaming services. Unlike traditional platforms, LavaRox allows users to pay using local payment methods like bKash, Nagad, and Rocket—no debit or credit card required. Users can also easily track their daily watch time and manage their subscriptions through a simple and user-friendly interface.",
        "tec_used": [
            "React",
            "Tailwind",
            "css",
            "MongoDB",
            "Express",
            "Firebase"
        ],
        "live_link": "https://subscription-box-1eb8d.web.app/",
        "frontend_repo": "https://github.com/dip00-bb/react-authentication",
        "backend_repo": "",
        "features": [
            "🛒 Users can buy subscriptions",
            "💬 Users can comment on services",
            "📊 Users can monitor their activity on the dashboard",
            "🔐 Firebase Authentication for secure login/signup"
        ],
        "images": [
            "https://i.ibb.co/wDKZ5zR/subbox1.png",
            "https://i.ibb.co/KptwZd6H/subbox2.png",
            "https://i.ibb.co/Kc0S3xyP/subbox3.png"
        ],
        "challenges": "I didn’t face any major issues in this project because it was a simple one with a small number of pages.",
        "improvement":"Future plans for Sub Box include expanding the list of available OTT platforms and adding automated subscription renewal reminders to improve convenience for users. Enhanced watch-time analytics will give users deeper insights into their viewing habits. Integration with more local and international payment gateways will broaden accessibility. Additional improvements could include a wishlist feature for upcoming shows, personalized subscription suggestions based on user preferences, and a mobile app version for a more seamless, on-the-go experience."
    }
]